{
  "backend/main.mo": "Main Motoko actor implementing income tracking with Person and IncomeEntry types, access control integration (admin/user roles with token-based initialization), and CRUD operations for persons, income entries, and user profiles.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files including components, pages, hooks, and utilities for the income tracker application.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes including background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Spending/Income Tracker application.",
  "frontend/src/App.tsx": "TanStack Router setup defining root route with AppLayout wrapper and three child routes: dashboard (/), income-entry (/income-entry), and admin (/admin).",
  "frontend/src/components/AppLayout.tsx": "Shared layout component with sticky header containing logo, navigation links (Dashboard, Income Entry, Admin) with active state styling, and footer with Caffeine attribution.",
  "frontend/src/components/EntriesTable.tsx": "Reusable table component displaying income entries with formatted dates and amounts, optional delete actions with confirmation dialogs, loading states, and empty state messaging.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity authentication button with login/logout functionality, loading states, query cache clearing on logout, and error handling for duplicate authentication.",
  "frontend/src/components/PersonTabs.tsx": "Accessible tab navigation component rendering person tabs with keyboard support, active state highlighting, and selection callbacks.",
  "frontend/src/hooks/useActor.ts": "React Query hook managing backend actor creation with Internet Identity authentication, automatic admin token initialization, and query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication using @dfinity/auth-client, providing login/logout functionality, identity state management, and authentication status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating backend data including entries, persons, user profiles, admin status, and income calculations, using the actor from useActor hook.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm neutral color scheme with green accents for light and dark modes, plus chart color definitions.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page for managing persons and entries with authentication checks, bootstrap admin functionality, and CRUD operations including delete confirmations via alert dialogs.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard displaying income statistics (total, monthly, entry count) with person tabs and an entries table, showing loading and empty states appropriately.",
  "frontend/src/pages/IncomeEntryPage.tsx": "Admin-only page for creating income entries with form inputs for ICP amount, token value, person selection, and date validation, requiring Internet Identity authentication.",
  "frontend/src/utils/adminTokens.ts": "Utility for retrieving admin tokens from URL parameters or session storage with safe fallback defaults to ensure backend admin bootstrap functionality works.",
  "frontend/src/utils/receivedDate.ts": "Provides date validation and conversion utilities, including validateDateInputs for checking date validity and convertDateToTime for converting dates to backend Time format (nanoseconds since epoch).",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, typography, animations, and design tokens for a component-based UI system.",
  "project_state.json": "Project state file tracking feature requests to sort income entries by newest date first, requiring backend query modification (AR-2) and frontend display adjustment (AR-3)."
}