{
  "kind": "build_request",
  "title": "Spending/Income Tracker: Admin entry input + Public dashboard with running total",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement backend data model and persistence for income entries, each containing: date, ICP amount, ICP token value, and derived income (ICP amount × ICP token value). Provide query methods to list all entries publicly and compute the running total income across all entries.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-3"
        ],
        "quotes": [
          "Admin will add date, ICP amount, ICP token value, App will calculate all income and show to users.",
          "the app calculate income as a running total of (ICP amount × token value)"
        ]
      },
      "acceptanceCriteria": [
        "Backend stores entries durably in the single Motoko main actor.",
        "There is a public (no-auth) query to fetch the list of all entries.",
        "There is a public (no-auth) query to fetch total income computed as sum(entry.icpAmount * entry.icpTokenValue).",
        "Income calculation uses the exact formula ICP amount × token value and totals across all entries."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add admin authorization using Internet Identity principals: only an admin can create entries. If no admin is set yet, set the first authenticated caller to be the admin; allow the current admin to transfer admin rights to another principal.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "1 using Internet Identity"
        ]
      },
      "acceptanceCriteria": [
        "Unauthenticated/public calls can read entries and totals but cannot add entries.",
        "Authenticated non-admin principals are rejected when attempting to add entries.",
        "If admin is unset, the first authenticated caller becomes admin.",
        "Admin can transfer admin to a specified principal; subsequent admin-only actions require the new admin principal."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Create a public dashboard page (no login required) that displays: (1) the running total income and (2) a table/list of all entries with date, ICP amount, ICP token value, and computed income per entry.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-3"
        ],
        "quotes": [
          "everyone can see result without being logged in.",
          "2 also a list of all entries (date, ICP amount, ICP token value)"
        ]
      },
      "acceptanceCriteria": [
        "Opening the app without signing in shows the dashboard with totals and entries.",
        "The entries list shows date, ICP amount, ICP token value, and per-entry income (amount × token value).",
        "The total income matches the sum of per-entry income values shown."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Create an admin panel page where the user can sign in with Internet Identity and, if authorized as admin, add a new entry (date, ICP amount, ICP token value). On successful submission, the public dashboard data is refreshed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-3"
        ],
        "quotes": [
          "Admin can add data from admin panel",
          "1 using Internet Identity"
        ]
      },
      "acceptanceCriteria": [
        "Admin panel provides Internet Identity sign-in/out controls.",
        "Admin panel shows an add-entry form with inputs for date, ICP amount, and ICP token value.",
        "Submitting the form as admin creates a new backend entry and updates the UI list/total afterward.",
        "If a signed-in user is not admin, the admin panel shows an access-denied state and does not allow submission."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Apply a coherent visual theme across the app (layout, typography, spacing, and component styling) suitable for a financial ledger. Use a warm neutral palette with green accents (avoid blue/purple) and consistent styling for cards, tables, and forms.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "build now"
        ]
      },
      "acceptanceCriteria": [
        "Public dashboard and admin panel share consistent typography, spacing, and component styling.",
        "Primary accents are green with warm neutral backgrounds; blue/purple are not the dominant theme colors.",
        "Tables/forms are readable and visually aligned with the chosen theme."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in the main actor).",
    "Frontend must use React + TypeScript + Tailwind + React Query.",
    "Do not modify files under frontend immutablePaths (compose existing hooks/components instead).",
    "Public users must be able to view results without logging in; only admin actions require Internet Identity."
  ],
  "nonGoals": [
    "Multi-admin roles/permissions beyond a single admin principal and optional transfer.",
    "External databases or third-party auth providers other than Internet Identity.",
    "Real-time updates via websockets/push; data refresh may be via manual or post-mutation refetch."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}